scripts/benchmark_results/benchmark_20260305_180130.txt
==========================================
   压测报告 - 2026年 3月 5日 星期四 18时01分30秒 CST
==========================================

This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /health
Document Length:        301 bytes

Concurrency Level:      100
Time taken for tests:   1.046 seconds
Complete requests:      5000
Failed requests:        4898
   (Connect: 0, Receive: 0, Length: 4898, Exceptions: 0)
Non-2xx responses:      4898
Keep-Alive requests:    5000
Total transferred:      1064678 bytes
HTML transferred:       241316 bytes
Requests per second:    4780.32 [#/sec] (mean)
Time per request:       20.919 [ms] (mean)
Time per request:       0.209 [ms] (mean, across all concurrent requests)
Transfer rate:          994.04 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       3
Processing:     0    5  30.5      1    1003
Waiting:        0    5  30.5      1    1003
Total:          0    5  30.6      1    1004

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      2
  75%      2
  80%      2
  90%      3
  95%      5
  98%     11
  99%    202
 100%   1004 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/v1/jobs
Document Length:        4026 bytes

Concurrency Level:      100
Time taken for tests:   1.051 seconds
Complete requests:      5000
Failed requests:        4991
   (Connect: 0, Receive: 0, Length: 4991, Exceptions: 0)
Non-2xx responses:      4991
Keep-Alive requests:    4991
Total transferred:      1063646 bytes
HTML transferred:       250847 bytes
Requests per second:    4759.30 [#/sec] (mean)
Time per request:       21.012 [ms] (mean)
Time per request:       0.210 [ms] (mean, across all concurrent requests)
Transfer rate:          988.71 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       4
Processing:     0    5  28.0      1    1011
Waiting:        0    5  28.0      1    1011
Total:          0    5  28.0      1    1013

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      2
  80%      2
  90%      4
  95%      7
  98%     18
  99%    201
 100%   1013 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/v1/talents
Document Length:        86 bytes

Concurrency Level:      100
Time taken for tests:   0.381 seconds
Complete requests:      5000
Failed requests:        4991
   (Connect: 0, Receive: 0, Length: 4991, Exceptions: 0)
Non-2xx responses:      4991
Keep-Alive requests:    5000
Total transferred:      1028582 bytes
HTML transferred:       215387 bytes
Requests per second:    13123.33 [#/sec] (mean)
Time per request:       7.620 [ms] (mean)
Time per request:       0.076 [ms] (mean, across all concurrent requests)
Transfer rate:          2636.41 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.0      0      10
Processing:     0    5  20.8      2     202
Waiting:        0    5  20.8      2     202
Total:          0    5  20.9      2     202

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      3
  75%      3
  80%      4
  90%      6
  95%      9
  98%     20
  99%    201
 100%    202 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/v1/users/me
Document Length:        43 bytes

Concurrency Level:      100
Time taken for tests:   0.234 seconds
Complete requests:      5000
Failed requests:        0
Non-2xx responses:      5000
Keep-Alive requests:    5000
Total transferred:      1025000 bytes
HTML transferred:       215000 bytes
Requests per second:    21335.06 [#/sec] (mean)
Time per request:       4.687 [ms] (mean)
Time per request:       0.047 [ms] (mean, across all concurrent requests)
Transfer rate:          4271.18 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       2
Processing:     0    4  25.1      1     205
Waiting:        0    4  25.1      1     205
Total:          0    4  25.2      1     206

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      2
  98%      8
  99%    201
 100%    206 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/v1/recommendations/stats
Document Length:        43 bytes

Concurrency Level:      100
Time taken for tests:   0.318 seconds
Complete requests:      5000
Failed requests:        10
   (Connect: 0, Receive: 0, Length: 10, Exceptions: 0)
Non-2xx responses:      4990
Keep-Alive requests:    5000
Total transferred:      1030750 bytes
HTML transferred:       217190 bytes
Requests per second:    15747.88 [#/sec] (mean)
Time per request:       6.350 [ms] (mean)
Time per request:       0.064 [ms] (mean, across all concurrent requests)
Transfer rate:          3170.34 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       3
Processing:     0    4  23.0      1     225
Waiting:        0    4  23.0      1     225
Total:          0    4  23.1      1     225

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      2
  90%      2
  95%      3
  98%      5
  99%    201
 100%    225 (longest request)